Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/C10B.tmx
Source language: en_us
Languages: zh_cn

source: Hedy Lamarr’s World War II Adventure
zh_cn: 海蒂・拉玛尔第二次世界大战的传奇经历

source: On a sweltering Paris evening in June 1926, a 25-year-old pianist and composer from Trenton stepped out onto the stage of the Thétre des Champs-lysées, which was crowded with an array of pianos, bass drums, xylophones, electric bells and electric fans (later to be substituted by enormous airplane propellers), as well as a hand-cranked siren.
zh_cn: 1926 年巴黎一个闷热的夜晚，一位来自美国特伦顿的二十五岁青年画家兼作曲家踏进了香榭丽舍剧院 （Théatre des Champs-lysées）。剧院里除了一只手提警报器，还摆放着一排钢琴、低音鼓、木琴、电铃音乐器和巨大的电扇（不久之后这些巨大的电扇将会被巨型飞机螺旋推进器所代替）。

source: He nodded to the conductor, and the stuffy air in the hall suddenly began pulsing and throbbing, banging and wailing with a loud and persistent mechanical cacophony.
zh_cn: 年轻人向指挥点点头，接着礼堂中突然传出了巨大、连续不断、刺耳的机械声，礼堂弥漫的空气好像都在颤抖并呼啸着。

source: Within a few minutes, according to one eyewitness, the concert had degenerated into a shouting match: “Above the mighty noise of the pianos and drums arose catcalls and booing, shrieking and whistling, shouts of ‘thief’ mixed with ‘bravo.’
zh_cn: 根据一位目击者回忆，几分钟之后，音乐厅里顿时吵嚷声一片：“巨大的钢琴声和敲鼓声片刻引起了台下观众的嘘声、口哨声、尖叫声，有的大声嚷着‘小偷’、有的人大声赞叹着‘好哎’ ”。

source: ” The audience, which included Eliot, Pound, Joyce and Diaghilev, was in an uproar.
zh_cn: 坐在台下的观众有很多名人，如艾略特、庞德、乔伊斯和佳吉列夫，也同样引起了他们的一阵喧嚣。

source: The young composer from Trenton was George Antheil.
zh_cn: 这个年轻人就是乔治・安泰尔（George Antheil）。

source: At 5-foot-4, with a round, cherubic face and straight blond hair perfectly parted like a choirboy’s, he resembled anything but the piece of aggressive musical brutalism that was inciting the crowd.
zh_cn: 他身高1.62米，一张娃娃脸，笔直的金头，梳着整洁的中分，看起就像唱诗班的男孩歌手。无论如何，安泰尔的外表也不像个狂野的、能引起人们骚动的野兽派艺术家。

source: It was originally called “Message to Mars,” and was intended to be music for a Dadaist film. The title had been changed to “Ballet Mécanique,” perhaps better to amplify the work’s emphatic embrace of Machine Age aesthetics, a kind of futuristic robo-art that Fritz Lang would evoke the following year in his film “Metropolis.”
zh_cn: 安泰尔创作的这部音乐作品刚开始被命名为《火星信使》，是为达尔文主义电影创作的电影配乐，之后音乐易名为《机械芭蕾》，因为新名字更能充分表现机械时代的审美哲学，第二年弗瑞兹・朗的电影《大都市》就唤醒了这种未来主义机器美学。

source: Antheil had arrived in Paris in 1923 via Berlin and had soon endeared himself to its Left Bank intelligentsia, moving with his future wife, a Hungarian woman named Boski, into a tiny apartment on the second floor of Sylvia Beach’s Shakespeare &amp; Company bookstore and remaining there for 10 years.
zh_cn: 安泰尔于1923年从伯林来到巴黎，很快他就赢得巴黎左岸知识分子们的喜爱，然后他和匈牙利的未婚妻波尔基，搬到西尔维亚海滩&amp;莎士比亚公司书店二楼的一所公寓里居住，并在这里长住十年之久。

source: He shared with his hero Stravinsky a desire to distance himself from the previous generation’s plush Romanticism by posing in its place a musical ideal of severe objectivity and mechanistic precision.
zh_cn: 他和他心目中的偶像作曲家斯特拉文斯基（Stravinsky）一样，希望远离上一代人音乐作品中奢华的浪漫主义元素和风格，他要创作出心中的理想音乐，一种客观真实、叮当作响的机械声音。

source: “Ballet Mécanique” made Antheil a celebrity.
zh_cn: 好莱坞女星海蒂・拉玛尔 《机械芭蕾》使安泰尔成了名人。

source: He followed it with other attention-getting projects, including a “Jazz Symphony” and an opera, “Transatlantic,” which when it had its premiere in Frankfurt in 1930 featured an American presidential candidate caught in a love nest and a soprano singing an aria while taking a bath.
zh_cn: 接着他又创作了其它几部颇引人关注的音乐作品，如《爵士交响曲》、歌剧《穿越大洋》（1930年在法兰克福首次公演）――一位美国总统侯选人陷入情网，还有一位男高音歌唱家泡在浴盆里高唱咏叹调，这样的情节很是令人难忘。

source: For an American composer he was receiving a lot of attention, but he was nonetheless desperately, chronically broke.
zh_cn: 作为一位先锋派作曲家，安泰尔很受关注，但是他也同样在创作道路上倍受打击，身心疲惫。

source: With Europe on economic spin cycle and fascism on the rise, Antheil returned home to America, living briefly in New York, where he wrote “squibs” for Esquire magazine, including advice for young lovers.
zh_cn: 在欧洲经济越来越萧条，法西斯主义势力不断抬头之时，安泰尔返回了美国。他曾在纽约小住，靠为《君子》杂志写讽刺文章谋生，他还为杂志写过一些有关年轻恋人相处之道的文章。

source: He also published a book, “Every Man His Own Detective: A Study of Glandular Criminology.”
zh_cn: 他曾出版过一本书名字叫《每个人都是自己的侦探：犯罪学腺体研究》。

source: In 1936, with a $4,000 advance from Esquire, the couple drove across the country to Hollywood, where Antheil offered himself to the movie studios.
zh_cn: 1962年安泰尔带着从杂志社预支的4000美元和妻子驾车来到好莱坞，安泰尔自动提出要到好莱坞的电影工作室。

source: The former avant-garde musical anarchist was ready to go to work for the Beast itself, and soon he was busily if not lucratively scoring films for Cecil B. DeMille.
zh_cn: 现在这位音乐界的先锋作曲家真的开始为“野兽派”工作了，很快他就在塞西尔·B·戴米尔电影公司为电影配乐，虽然成就不大，但他工作非常勤奋。

source: At the same time Antheil was plugging away in Hollywood studios, the movie mogul Louis B. Mayer, on a visit to London, was introduced to a startlingly beautiful Vienna-born actress who, although still in her early 20s, had accomplished her own scandal by appearing nude and simulating passionate adulterous sex in a mostly silent movie called “Ecstasy.”
zh_cn: 作曲家乔治・安泰尔 在好莱坞努力工作的安泰尔在一次伦敦之旅中，电影巨头路易斯・梅尔把他介绍给了一位非常漂亮的维也纳女演员。虽然这位女演员刚刚二十出头，但是早已经名声大噪，她因在默片《狂喜》中体出镜而引起一片非议，这也使她成为当时最著名的性感尤物。

source: The daughter of an affluent Jewish banker, Hedwig Kiesler had studied ballet and classical piano, attended an exclusive girls’ school in Switzerland and had already endured several years as the trophy wife of Fritz Mandl, an immensely wealthy Austrian munitions manufacturer.
zh_cn: 这位女演员就是海德维希・基斯勒（Hedwig Kiesler）――一位富有的银行家的女儿，学习过芭蕾、钢琴，曾在瑞典的女子学校上学，并且和非常有钱的奥地利军火商弗里特兹・曼迪（Fritz Mandl）有过几年婚姻生活。

source: Her acting credits were slight — her jealous husband, after the wedding, had forbidden her from further movie work and had even attempted to buy up every existing copy of “Ecstasy” — but the great stage director Max Reinhardt thought enough of her to cast her in several productions and had given her the sobriquet that would define her for the rest of her life, “the most beautiful woman in the world.”
zh_cn: 虽然她的演技没有受到人们的重视――她的丈夫阻挠她继续拍戏并试图买下电影《狂喜》的所有拷贝，但是出色的舞台导演马克斯・莱因哈特却很欣赏海德维希，而且还让她在自己的作品中担任主角，并给了她一个伴随一生的绰号――“世界上最漂亮的女人”。

source: Hedwig Kiesler, at the time she met Mayer, had just run away from her suffocating life as Mandl’s bride, fleeing with only her luggage and jewelry in search of a chance to go back to acting.
zh_cn: 海德维希在遇见梅尔时刚刚离家出走，逃离身为人妻的压抑生活，计划寻找机会重新演戏。

source: But she scrounged enough to book passage on the Normandie, the exclusive luxury liner on which Mayer and his party were returning to America.
zh_cn: 虽然她从家出走时只带了一个行李箱和一些珠宝，并且绞尽脑汁在诺曼底号豪华游轮订了一张船票，恰巧梅尔和他的随行人员也正在返回美国的途中。

source: Like many Hollywood stories, this one is encrusted with the usual legendary bons mots and self-serving anecdotes, but Mayer, who had seen “Ecstasy,” would be quoted as saying, “You’re lovely, but . . . I don’t like what people would think about a girl who flits bare-assed around the screen.”
zh_cn: 就像许多好莱坞的故事一样，这个故事同样也被习惯性地包装成神奇的、妙语连珠的对话和自恋式的轶闻趣事，但是如果梅尔看过电影《狂喜》的话，也会同样说“你很可爱，但是我不知道其他人看到一个姑娘光着屁股在大银幕上奔跑会怎么想”。
